s="，患者1天前负重劳作后于右上腹造口旁可触及一包块，约碗口大小，包块质软，可还纳，站立时突出，卧位时缓解；伴疼痛，呈持续性绞痛：右上腹造口停止排便排气。就诊于我院急诊，，查血示：，WBC：15.33*10^9/L，，NEU：93.10*10^9/L，余无明显异常。给予禁饮食、胃肠减压及抗感染等对症支持治疗，有所好转，请***会诊，考虑造口旁疝并肠梗阻可能。为行进一步治疗转入我科。患者自发病以来，未饮食，睡眠欠佳，小便未见异常，体重未见明显减轻。"
print('new',s[12:15],s[63:66],s[89:92],s[107:110])
print('old',s[12:17],s[63:68],s[89:92],s[107:110])
print('label',s[12:15],s[63:66],s[89:92],s[107:110],s[167:175])
s1="孕妇既往月经规律，月经周期37天，末次月经2016年3月5日，根据孕早期超声核实预产期2016年12月12日。停经后有轻微恶心、呕吐等早孕反应。孕早期有口服抗过敏药物（具体药物不详）及孕酮片（1片，qd）。孕4+月自觉胎动至今。孕中晚期无头昏、眼花及皮肤瘙痒等不适。孕期正规产检，唐氏筛查提示高危，行无创DNA低风险，胎儿系统超声未见异常，3+月前产检时OGTT提示空腹血糖高于正常，自行饮食控制，其后监测血糖基本正常，晚孕肝功、胆汁酸结果正常。今日已妊娠38+2周，7+小时前自觉阴道分泌物增多，伴不规律腹痛，无阴道流血，遂来我院，门诊行胰岛素样生长因子测定提示弱阳性，以“胎膜早破，妊娠期糖尿病，妊娠38+2周孕3产0LO先兆临产”收入院。患者孕期以来，精神食欲好，大小便正常，体重增长11Kg。"
print('new',s1[92:95],s1[119:120],s1[122:123],s1[159:165],s1[183:187],s1[203:205],s1[216:218],s1[241:243],s1[253:254],s1[257:259],s1[270:280],s1[288:292],s1[293:299],s1[313:317])
print('label',s1[92:95],s1[119:120],s1[122:123],s1[159:165],s1[183:187],s1[203:205],s1[241:243],s1[253:254],s1[257:259],s1[270:280],s1[288:292],s1[293:299],s1[300:317])
print('old',s1[92:95],s1[119:120],s1[122:123],s1[140:144],s1[152:154],s1[177:181],s1[183:187],s1[203:205],s1[241:243],s1[253:254],s1[257:259],s1[270:280],s1[288:292],s1[293:299])

